# Задание
# Напишите программу, которая запрашивает пользователя ввести его имя, после чего выводит сообщение:
# Добро пожаловать, ИМЯ_ПОЛЬЗОВАТЕЛЯ ! 

USERNAME = input('Введите ваше имя, Артем К.:') # Спрашиваешь имя

print("Добро пожаловать, " + USERNAME + "!") # Дароваешься