# Задание
# Напишите программу по следующему условию:
# Дана строка X, необходимо определить сколько символов X в строке N и вывести число на экран.
# X и N - вводятся пользователем 

STR_X = input("Введите строки: ") # Пользовательские строки которые он вводит в консоль
STR_N = input("Введите строки: ") # Пользовательские строки которые он вводит в консоль

print("Длина X: " + str(len(STR_X))) # Длина строки X в виде текста
print("Длина N: " + str(len(STR_N))) # Длина строки N в виде текста